/* ============================================================================
    Linguagem C, o curso definitivo
    Módulo 8 Aula 5b
    Título da Aula
    
    Autor: Msc. Eng. Rogério Souza da Silva
    Data:  Dezembro de 2021

    
Exercício proposto: projete uma função recursiva para imprimir os números de 1 a n, sendo n o número passado como parâmetro para a função.
Exemplo: o parâmetro passado é 5. A saída da função será, 1,2,3,4,5.

============================================================================ */


/* ========================================================================= */
/* --- Bibliotecas --- */
#include <stdio.h>
#include <stdlib.h>


/* ========================================================================= */
/* --- Constantes --- */


/* ========================================================================= */
/* --- Protótipo das Funções --- */

int cont(int n);

/* ========================================================================= */
/* --- Variáveis Globais --- */
int i=1;

/* ========================================================================= */
/* --- Função Principal --- */
int main()
{
		
	cont(5);

}
/* --- Desenvolvimento de funções --- */

int cont(int n)
{
		
		
	if (n == 0) return 0;
	
	else
	{
		printf("%d, ",n-n+i);
		n--;
		i++;
		cont(n);	
	}

	return 0;
}


/* ============================================================================  
                                                              
                                       _                      
                                      / \                     
                                     |oo >                    
                                     _\=/_                    
                    ___         #   /  _  \   #               
                   /<> \         \\//|/.\|\\//                
                 _|_____|_        \/  \_/  \/                 
                | | === | |          |\ /|                    
                |_|  0  |_|          \_ _/                    
                 ||  0  ||           | | |                    
                 ||__*__||           | | |                    
                |* \___/ *|          []|[]                    
                /=\ /=\ /=\          | | |                    
________________[_]_[_]_[_]_________/_]_[_\_______________________________
                                                              
                                                              
============================================================================ */
/* --- Final do Programa --- */


